## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_mongo_collection.lagfest will be updated in-place
  ~ resource "azurerm_cosmosdb_mongo_collection" "lagfest" {
        id                     = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756/mongodbDatabases/main/collections/ruut-lagfest"
        name                   = "ruut-lagfest"
        # (8 unchanged attributes hidden)

      - index {
          - keys   = [
              - "_id",
            ] -> null
          - unique = true -> null
        }
      + index {
          + keys   = [
              + "_id",
            ]
          + unique = false
        }
    }

  # module.function.azurerm_function_app_function.lagfest_signups must be replaced
-/+ resource "azurerm_function_app_function" "lagfest_signups" {
      ~ config_json          = jsonencode(
          ~ {
              ~ bindings = [
                  ~ {
                      ~ name      = "lagfest" -> "req"
                      ~ route     = "lagfest-signup" -> "lagfestSignup"
                        # (4 unchanged attributes hidden)
                    },
                    {
                        direction = "out"
                        name      = "$return"
                        type      = "http"
                    },
                ]
            }
        )
      ~ config_url           = "https://ruut-backend-function-app.azurewebsites.net/admin/vfs/home/site/wwwroot/lagfest-signups-function/function.json" -> (known after apply)
      ~ id                   = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app/functions/lagfest-signups-function" -> (known after apply)
      ~ invocation_url       = "https://ruut-backend-function-app.azurewebsites.net/api/lagfest-signup" -> (known after apply)
        name                 = "lagfest-signups-function"
      ~ script_root_path_url = "https://ruut-backend-function-app.azurewebsites.net/admin/vfs/home/site/wwwroot/lagfest-signups-function/" -> (known after apply)
      + script_url           = (known after apply)
      + secrets_file_url     = (known after apply)
      - test_data            = jsonencode(
            {
              - body              = jsonencode(
                    {
                      - body              = jsonencode(
                            {
                              - name = "elias"
                            }
                        )
                      - headers           = []
                      - method            = "post"
                      - queryStringParams = []
                    }
                )
              - headers           = []
              - method            = "post"
              - queryStringParams = []
            }
        ) -> null
      ~ test_data_url        = "https://ruut-backend-function-app.azurewebsites.net/admin/vfs/tmp/FunctionsData/lagfest-signups-function.dat" -> (known after apply)
      ~ url                  = "https://ruut-backend-function-app.azurewebsites.net/admin/functions/lagfest-signups-function" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ file { # forces replacement
          ~ content = <<-EOT # forces replacement
                import azure.functions as func
                import logging
              + import pytz
              + import json
                import re
                from datetime import datetime, timedelta
              - import pytz
                
              - TZ = pytz.timezone("Europe/Helsinki")
              - signup_start = TZ.localize(datetime(2024, 2, 15, 16))
              - 
              - app = func.FunctionApp()
              + app = func.FunctionApp(http_auth_level=func.AuthLevel.ANONYMOUS)
                func.HttpResponse.mimetype = 'application/json'
                func.HttpResponse.charset = 'utf-8'
                
              + TZ = pytz.timezone("Europe/Helsinki")
              + signup_start = TZ.localize(datetime(2024, 2, 15, 11))
                
              - @app.function_name(name="LagFestSignUp")
              - @app.route(route="lagfest-signup")
              - def lagfest_signup(req: func.HttpRequest) -> func.HttpResponse:
              -     logging.info('Python HTTP trigger function processed a request.')
              + 
              + @app.route(route="lagfestSignup")
              + def lagfestSignup(req: func.HttpRequest) -> func.HttpResponse:
                    now = datetime.now(tz=TZ)
              +     logging.info(
              +         f'Python HTTP trigger function processed a request. Time is {now}')
                
                    if now < signup_start:
                        logging.info('Returned 400 for too early submission')
              -         return func.HttpResponse({"message": "Ilmoittautuminen ei ole vielä auki", "retry": True},
              +         message = json.dumps(
              +             {"message": "Ilmoittautuminen ei ole viela auki", "retry": True})
              +         return func.HttpResponse(body=message,
                                                 status_code=400)
                
              -     data = req.get_json()
              +     try:
              +         data = req.get_json()
              +     except:
              +         logging.info('Returned 400 for no data')
              +         message = json.dumps(
              +             {"message": "Et antanut mitaan tietoja", "retry": False})
              +         return func.HttpResponse(body=message,
              +                                  status_code=400)
              + 
                    if not data:
                        logging.info('Returned 400 for no data')
              -         return func.HttpResponse({"message": "Et antanut mitään tietoja", "retry": False},
              +         message = json.dumps(
              +             {"message": "Et antanut mitaan tietoja", "retry": False})
              +         return func.HttpResponse(body=message,
                                                 status_code=400)
                
                    form_fields = [
                        ("name", str),
                        ("email", str),
                        ("yell", str),
                        ("ticket", str),
                        ("gdpr", bool),
                    ]
                
                    s = [
                        field not in data or not isinstance(data[field], type)
                        for (field, type) in form_fields
                    ]
                
              +     try:
              +         data["gdpr"]
              +     except:
              +         logging.warning("no gdpr data")
              +         message = json.dumps(
              +             {"message": "Sinun tulee hyvaksya tietojen kasittely GDPRn mukaisesti, jotta voit ilmoittautua.", "retry": True})
              +         return func.HttpResponse(body=message,
              +                                  status_code=400)
              + 
                    if not data["gdpr"]:
                        logging.info('Returned 400 for no gdpr agreement')
              -         return func.HttpResponse({"message": "Sinun tulee hyäksyä tietojen käsittely GDPRn mukaisesti, jotta voit ilmoittautua.", "retry": True},
              +         message = json.dumps(
              +             {"message": "Sinun tulee hyvaksya tietojen kasittely GDPRn mukaisesti, jotta voit ilmoittautua.", "retry": True})
              +         return func.HttpResponse(body=message,
                                                 status_code=400)
              +     try:
              +         re.match(r"^.*@student.l(ut|ab).fi$", data["email"], flags=re.I)
              +     except:
              +         logging.warning("No valid email")
              +         message = json.dumps(
              +             {"message": "No valid email.", "retry": True})
              +         return func.HttpResponse(body=message,
              +                                  status_code=400)
                
                    if not re.match(r"^.*@student.l(ut|ab).fi$", data["email"], flags=re.I):
                        if now < signup_start + timedelta(hours=1):
                            logging.info('Returned 400 for too early for non student')
              -             return func.HttpResponse({"message": 'Voit ilmoittautua vasta tuntia myöhemmin, jos sähköpostisi ei ole muotoa "@student.lut.fi" tai "@student.lab.fi".', "retry": True},
              +             message = json.dumps(
              +                 {"message": 'Voit ilmoittautua vasta tuntia myohemmin, jos sähkopostisi ei ole muotoa "@student.lut.fi" tai "@student.lab.fi".', "retry": True})
              +             return func.HttpResponse(body=message,
                                                     status_code=400)
                
                    signup = {}
                
                    for field, _ in form_fields:
                        if field in data:
                            signup[field] = data[field]
                
                    signup["time"] = datetime.now(tz=TZ)
                
                    logging.info(f"Successful submission for {data.get('name')}.")
              -     return func.HttpResponse({"message": "Kiitos ilmoittautumisestasi!"},
              +     message = json.dumps({"message": "Kiitos ilmoittautumisestasi!"})
              +     return func.HttpResponse(body=message,
                                             status_code=400)
            EOT
            name    = "function_app"
        }
      ~ file { # forces replacement
          ~ content = <<-EOT # forces replacement
              - azure_storage==0.37.0
              - pytz==2023.3.post1
              + # DO NOT include azure-functions-worker in this file
              + # The Python Worker is managed by Azure Functions platform
              + # Manually managing azure-functions-worker may cause unexpected issues
              + 
              + azure-functions
              + pytz
            EOT
            name    = "requirements"
        }
      + file { # forces replacement
          + content = jsonencode(
                {
                  + extensionBundle = {
                      + id      = "Microsoft.Azure.Functions.ExtensionBundle"
                      + version = "[4.*, 5.0.0)"
                    }
                  + logging         = {
                      + applicationInsights = {
                          + samplingSettings = {
                              + excludedTypes = "Request"
                              + isEnabled     = true
                            }
                        }
                    }
                  + version         = "2.0"
                } # forces replacement
            )
          + name    = "requirements" # forces replacement
        }
    }

  # module.function.azurerm_linux_function_app.backend will be updated in-place
  ~ resource "azurerm_linux_function_app" "backend" {
        id                                             = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app"
        name                                           = "ruut-backend-function-app"
        tags                                           = {}
        # (28 unchanged attributes hidden)

      ~ site_config {
            # (23 unchanged attributes hidden)

          - cors {
              - allowed_origins     = [
                  - "https://portal.azure.com",
                ] -> null
              - support_credentials = true -> null
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>